{
  "ID": 8,
  "Name": "Mekka & Symposium 2001",
  "EventType": [
    "Demo Party"
  ],
  "AKA": "MS2K+1, MS2001, symmek 2k+1",
  "Address": "Heidmarkhalle",
  "Zip": "D-29683",
  "City": "Fallingbostel",
  "Country": "Germany",
  "Website": "http://ms.demo.org/2001/",
  "Compo": [
    {
      "Type": "Outside Compo",
      "ReleaseIDs": [
        5089,
        102320,
        7847,
        99782,
        7484,
        3979,
        2688,
        2601
      ]
    },
    {
      "Type": "C64 4K Intro",
      "ReleaseIDs": [
        2,
        8341,
        2768,
        3239,
        8336,
        3242,
        922,
        8338,
        8340,
        3243,
        8342,
        8337,
        7899,
        167,
        3240,
        8339,
        24,
        8254,
        3241,
        3237,
        3238
      ]
    },
    {
      "Type": "C64 Demo",
      "ReleaseIDs": [
        3254,
        1,
        3248,
        2608,
        46,
        11670,
        707,
        142,
        3251,
        3253,
        3250
      ]
    },
    {
      "Type": "C64 32K Game",
      "ReleaseIDs": [
        28
      ]
    },
    {
      "Type": "C64 Graphics",
      "ReleaseIDs": [
        3260,
        8316,
        8315,
        3264,
        8317,
        3263,
        3257,
        3262,
        3268,
        3255,
        3259,
        3258,
        852,
        3261,
        113087,
        3265,
        3256
      ]
    },
    {
      "Type": "C64 Music",
      "ReleaseIDs": [
        3289,
        3271,
        3272,
        3273,
        8334,
        8335,
        8329,
        8323,
        8333,
        8330,
        8321,
        3288,
        8326,
        3285,
        3270,
        3287,
        3286,
        8325,
        8322,
        8332,
        7240,
        7895,
        8327,
        8331,
        8328,
        3275,
        8324,
        8320,
        3274
      ]
    },
    {
      "Type": "WiLD Demo",
      "ReleaseIDs": [
        2942
      ]
    },
    {
      "Type": "Mixed",
      "ReleaseIDs": [
        8343
      ]
    }
  ],
  "PartyReport": [
    {
      "WrittenBy": "FRaNKy/Role",
      "Date": 1012802400,
      "Headline": "Mekka & Symposium 2001 Party Report",
      "Text": "Friday - 14:00 - The Departure \n\n\nWe are going to Symposium !!! It's fourteen hundred hours and I'm ready to depart in my hometown of Asse (Belgium). I got to say hello to the parental units first in Leuven and also pick up a new harddisk for my laptop there - there is a party network and I intend to use it ! \n\nFriday - 15:30 - Commander's Place \n\n\nI pick up our beloved leader Commander at his house in Genk and before taking off to a couple hours of highway driving we head to the local Aldi store and get some very needed supply's - Mostly existing out of lemonade and candy, sorry no beer... \n\nFriday - 16:00 - Vroom ! \n\n\nAnd we're off ! Crossing Holland very very fast (so we do not get contaminated with that foot & mouth thing) the trip passes Aachen, Koln, Wuppertal, Hannover and Fallingbostel - before ending up at the Heidmarkhalle there is the traditional stop at the McDonalds, where a very unfriendly woman was behind the counter - must be the time of the month.. \n\nFriday - 21:30 - There At Last ! \n\n\nArriving a couple of hours earlier then i had hoped we meet with the rest of Spiders Crew and Role members, not after saying hello to Santa Claus and some other Belgian guy, obviously from the town of Antwerpen. \n\nFriday - 23:00 - Welle:Erdball \n\n\nWelle:Erdball made the soundtrack for a SuperCPU game. They give a small concert (23, Nintaendo Shock, F104), it was pretty nice but last years concert was better (probably because Welle:Erdball was completely new to me at the time). One of their background singers was pretty nice tho :) Pictures are in the mugshots gallery. \n\nFriday - 23:30 - Problems ? \n\n\nAaaaaaargh, my new harddisk does not work, well, it kinda works but it is too big for the BIOS in my old laptop... Even with some IBM and SeaGate tools I can't get it to work... The plans for leeching the party network with all kinds of goodies are scrapped (not much work, as they were pretty inexistant anyway) and the 800mb drive keeps in use. At the same time Exile's (Anubis) has some other problems on his Amiga, the harddisk kind of crashed and he has probably lost a lot of data and has to re-install the thing... yes people, Amiga's CAN crash.... For a screenshot, head to the Pictures Page. \n\nSaturday - 11:30 - One More Try \n\n\nOne more go on the harddisk with some new software, no luck... I give up. \n\nSaturday - 16:00 - Hard Disk Throwing \n\n\nThe annual Hard Disk Throwing competition ! And this time it was girls against boys... To keep things fair Steeler had arranged for the girls to throw with modern harddisks (3 inchers) and the boys could have some fun with end-of-80's big heavy boxes of copper and wiring. At the end there was also a cash-collection for Mat / Ozone who competed in the hd-throwing event but to give him the slightest amount of a chance he was allowed to compete with a girly-harddisk. You can find pictures from all this on the Mugshots page. \n\nSaturday - 19:00 - First Compo \n\n\nI just watched the first compo that kind of really interested me, the Amiga 64K Intro competition. There were (only) 5 entries but most of them showed that when you do not have the raw cpu power that the average PC of today has, you can still make damn good things when you think of design first. Although it got the most of applause I did not really like the 5th entry (Option by Potion), it just lasted way too long. But I guess I'll find out the results on Monday morning... \n\nSaturday - 19:45 - Wearables \n\n\nGot a party t-shirt... \n\nSaturday - 20:05 - Preview \n\n\nPreviewed the Role 4K C64 intro, Donno yet - only saw a couple of seconds on the screen next to me \n\nSaturday - 22:00 - Scenionaire \n\n\nMS is known for its funcompo's and this time it was 'who wants to be a scenionaire' with general-knowledge questions about the scene and it's history. First player was someone called 'codey' a 'modeller' for some PC group, and it showed.. He did not know a single EASY question about the Amiga or C64.. Personally I think that those kind of people should learn a bit of their history before they climb behind their PC's again and trade porn. Second up was XXX from Haujobb and was pretty cool, the last one was a Polish girl that had to be helped a lot but it was good fun. \n\nSaturday - 23:30 - Waiting for the compo's \n\n\nThe idea is to watch the Wild democompo but since it only starts at 1 am AND I want to be in some kind of living state tomorrow so I skip it and hit the sack... See you tomorrow... \n\nSunday - 10:30 - Gooooood morning Fallingbostel ! \n\n\nNothing is as good as a shower in the morning and getting ready for a day of competitions... And then you find a surprise when you get to your car... \n\nSunday - 10:40 - SNOW ! \n\n\nAnd lots of it ! There is a massive 5 centimeters of snow all over my car, something we are not that used to in Belgium. It takes me a good 20 minutes to clean it all of - it makes you wonder how many surfaces a Mercedes 250 has you know... answer : A FUCKLOAD ! \n\nSunday - 11:00 - In the hall... \n\n\nCommander is running around and no-one else is to be seen, most of them are looking at the Amiga 4K compo, that has some very nice entries - I don't understand how they can get all of that in only 4KBytes files.. Anyway's... I pick up Commander and we fuel up the car for the trip back to Belgium tomorrow and when coming back the C64 graphics compo is almost done. We just saw the Role picture (number 14 ! - Commander's Lucky Number) and then it was the wait for the Console Demo Competition.. I was very disappointed that there were only 3 entries, one for PSX, one for Gameboy Color and then a Dreamcast made by Haujobb. The last one had some nice effects but I know that a Dreamcast has more power - so I didn't make it the number one in my list, I gave that honor to the Gameboy demo just for the effort of the coder.... \n\nSunday - 14:30 - Weird Al Yankovic \n\n\nJust had a discussion about the fact of Al Yankovic does some polka-only albums and other stuff.. In short, since I know a LOT about Al Yankovic it was very clear that I was victorious over some people that are now sitting next to me and do not like their name (ab)used - Fucking Woozeez ! \n\nSunday- 15:00 - Whattahell ? \n\n\nThere is a lot of noise coming from the stage (We are sitting right behind the bigscreen on the first floor with the Role people) and there is a little concert going on with some niiiiiice beat-music and a couple of guys with didgeridoo's (something that exile describes as 'hollow bamboo sticks' - shame on you !). Also notably was the effort of XXX / Haujobb of undressing a Polish girl but he didn't get anything closer then touching the belly of that girl. I predicted he would not get any further - yet commander (aka the horny little bastard) was waiting for some titties... He didn't see any tho). Then was the PC 64K Intro Compo, I'm not going to watch that. \n\nSunday - 16:00 - Tentiii ! \n\n\nLogging on to the party IRC net work I noticed Tentacle, an old friend of mine so I decide to meet up at his table, Commander follows me (he is well trained, isn't he ? -grin-). We end up talking through the full length of the MP3 competition where Tentacle had an entry in, unfortunately it (a remix of Eminem's Slim Shade over some Britney Spears music) was not played. Tenti was going to kill some of the organizers and he would be coming over to my table if he was done to shoot the bigscreen. Until now I have not seen him so I guess that there are some organizers left alive :) I also got one of their \"Hard Core\" party t-shirts for 20DM - I first tried to buy it with a 100 BEF note and he gave me a 100 DKK note in return... Which is good since 100 DKK is about 500 Belgian francs - too bad he wanted it back.. grmbl... my profit was no more... \n\nSunday - 18:00 - C64 4K Intro \n\n\nTime for the C64 4K intro competition.. There were lots of entries and most of them were pretty to very good... It'll be hard to vote... \n\nSunday - 19:30 - Scenionaire Part 2 \n\n\nOne more game of 'who wants to be a scenionaire'. This time Mat/Ozone was called to the stage and Mat fulfilled completely to my expectancies, namely that he sees it all as a cool game. The first question in fact was : 'how do you jump higher in quake ?' - a: using a rocket / b: using a grenade / c: jumping against the walls / d: i don't know. The correct answer to be a scenionaire was ofcourse D because real sceners don't play quake ! \n\nSunday - 21:00 - DELAYS \n\n\nBecause of the many entries in C64 (10), Amiga (20 !!!!) and PC (27 ?) the competitions are delayed for some hours, in the meantime some ZX Spectrum demo's on the bigscreen but I think this is the same tape as last year so I'll skip this, I can view it from behind anyway :) \n\nSunday - 22:45 - Instructions \n\n\nSo you want to play a game on Exile's C128D ? (Picture available) Be prepared ! There are a lot of switches on the front. One for C64 mode, one for write protection (led indicator included), 2 switches for Dolphin Dos, a Disk-buffer flush and finally a reset button. So first you got to switch Dolphin Dos on and load the first file of a multiloader, then switch it off with button 2 and 3 AND flush the diskbuffers with the other one and then you can run whatever you want.. Just because doing it easy is for wimpz :) You get use to it tho... For the rest the organizers have been showing some Atari Falcon demo's (VERY nice ) and who knows what they will find out now, maybe a striptease by Steeler. Commander also asked me to write some text for ArachnoPhobia later on so I'll go and do that. But first back to some C64 games, and Vodka-Redbull ofcourse altho the Vodka in that combination is far more dominant than the Redbull :) \n\nMonday - 00:30 - 'Miggy Demo \n\n\nAfter lots of mpeg movies and others we finally arrived at the amiga demo compo (still playing while typing this) and to be short and loud : AMIGA RULEZ THE FUCKING KOZMOZZ !!!!!! Amiga is a platform where groups still can show that there is DESIGN in demo's except a load of 3D-effects that look nice but are at the same time pretty boring - some people won't agree with me but I think that design has priority over effects. \n\nBefore the compo started I also wrote my piece of text for the latest ArachnoPhobia issue, you can read it over there if you want to. \n\nMonday - 01:00 - The Quote ! \n\n\nQuote of the party by Faith / Role : \n\n\"Every company that has owned the Amiga has gone bankrupt\" \n\nMonday - 02:00 - Damn ! \n\n\nArachnoPhobia won't be finished... Stirf has some problems with the intro and some others I don't really know much about so we'll have to release it later... Also the bad party news is that we first have the PC democompo and then the C64 demo's... This is BAD... There are 27 PC demo's ! HELLO ORGANIZERS ???? \n\nMonday - 03:30 - Fuck 'm ! \n\n\nWe are waiting no longer for the C64 demo.. People need to drive 500km homewards tomorrow so the compo will be skipped.. This is some blame for the organizers I think... Anyway, everyone heads to the sleeping hall or cars to sleep so I'll do the same. \n\nMonday - 10:15 - The final countdown \n\n\nThe party is over... (and when typing this Notepad gives me an error that there is no more memory available - switching to WordPad). I meet with Commander at the entrance and we head for home. The party was fucking great - with excellent organization and events.. Just for that C64 democompo at 4:45 in the morning ??? Please ??? \n\nTuesday - 19:35 - Bye Bye ! \n\n\nIt is Tuesday and I'm at home when typing this - my unpacking left to do after a day's work - but first this report has to be uploaded... \n\nWhile you are on the net, check my other site : www.vendetta.org\" and do not forget the ROLE hq at www.role64.com. \n\nFRaNKy / ROLE signing off, see you at Mekka & Symposium 2002 - when we can all pay in Euro's !",
      "HandleID": 8071
    }
  ],
  "UserComment": [
    {
      "Date": 1378875600,
      "Text": "\"Apoptygma Berzerk - Eclipse\" played 24/7 there, i really liked it :)",
      "HandleID": 767
    }
  ],
  "StartDate": [
    {
      "Day": 13,
      "Month": 4,
      "Year": 2001
    }
  ],
  "EndDate": [
    {
      "Day": 16,
      "Month": 4,
      "Year": 2001
    }
  ],
  "Organizers": {
    "HandleIDs": [
      1679,
      1433,
      655
    ],
    "GroupIDs": [
      5
    ]
  }
}